jonacappelle/nRF52-DCU/TimeSync/time_sync.c
/*  ____  ____      _    __  __  ____ ___
 * |  _ \|  _ \    / \  |  \/  |/ ___/ _ \
 * | | | | |_) |  / _ \ | |\/| | |  | | | |
 * | |_| |  _ <  / ___ \| |  | | |__| |_| |
 * |____/|_| \_\/_/   \_\_|  |_|\____\___/
 *                           research group
 *                             dramco.be/
 *
 *  KU Leuven - Technology Campus Gent,
 *  Gebroeders De Smetstraat 1,
 *  B-9000 Gent, Belgium
 *
 *         File: time_sync.c
 *      Created: 2022-03-01
 *       Author: Jona Cappelle
 *      Version: 1.0
 *
 *  Description: Time synchronization MASTER functionality
 *
 *  Commissiond by Interreg NOMADe
 *
 */

/**
 * Copyright (c) 2014 - 2017, Nordic Semiconductor ASA
 *
 * All rights reserved.
 */

#include "time_sync.h"

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "app_error.h"
#include "app_util_platform.h"
#include "nrf.h"
#include "nrf_gpio.h"
#include "nrf_assert.h"
#include "nrf_atomic.h"
#include "nrf_balloc.h"
#include "nrf_error.h"
#include "nrfx_ppi.h"
#include "nrf_soc.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdm.h"

#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#define NRF_LOG_MODULE_NAME time_sync
#define NRF_LOG_LEVEL 4
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

#if   defined ( __CC_ARM )
#define TX_CHAIN_DELAY_PRESCALER_0 (699 - 235)
#elif defined ( __ICCARM__ )
#define TX_CHAIN_DELAY_PRESCALER_0 (703 - 235)
#elif defined ( __GNUC__ )
#define TX_CHAIN_DELAY_PRESCALER_0 (704 - 237)
#endif

#define SYNC_TIMER_PRESCALER 0
#define SYNC_RTC_PRESCALER 0

#if SYNC_TIMER_PRESCALER == 0
#define TX_CHAIN_DELAY TX_CHAIN_DELAY_PRESCALER_0
#else
#error Invalid prescaler value
#endif

#if TIME_SYNC_TIMER_MAX_VAL < 10000
#error Timer values below 10000 not supported
#endif

static void ts_on_sys_evt(uint32_t sys_evt, void * p_context);

NRF_SDH_SOC_OBSERVER(timesync_soc_obs,     \
                     TS_SOC_OBSERVER_PRIO, \
                     ts_on_sys_evt, 0);

#define TS_LEN_US                            (1000UL)
#define TX_LEN_EXTENSION_US                  (1000UL)
#define TS_SAFETY_MARGIN_US                  (500UL)   /**< The timeslot activity should be finished with this much to spare. */
#define TS_EXTEND_MARGIN_US                  (700UL)   /**< The timeslot activity should request an extension this long before end of timeslot. */


#define MAIN_DEBUG                           0x12345678UL

static void ppi_sync_timer_adjust_configure(bool do_count);
static void ppi_sync_timer_adjust_enable(void);
static void ppi_radio_rx_disable(void);
static void ppi_radio_rx_configure(void);
static void ppi_radio_tx_configure(void);
static uint32_t ppi_sync_trigger_configure(uint32_t ppi_endpoint);

typedef struct
{
    uint8_t                 rf_chn;          /** RF Channel [0-80] */
    uint8_t                 rf_addr[5];      /** 5-byte RF address */
    nrf_ppi_channel_t       ppi_chns[5];     /** PPI channels */
    nrf_ppi_channel_group_t ppi_chg;        /** PPI Channel Group */
    NRF_TIMER_Type *        high_freq_timer[2]; /** 16 MHz timer (e.g. NRF_TIMER2). NOTE: debug toggling only available if TIMER3 or TIMER4 is used for high_freq_timer[0]*/
    NRF_EGU_Type   *        egu;
    IRQn_Type               egu_irq_type;
} ts_params_t;

typedef PACKED_STRUCT
{
    int32_t  timer_val;
    int32_t  rtc_val;
    uint32_t counter_val;
} sync_pkt_t;

static nrf_atomic_u32_t first_sync_packet_cnt = 0;

static uint8_t          m_sync_pkt_ringbuf[10][sizeof(sync_pkt_t)];
static nrf_atomic_u32_t m_sync_pkt_ringbuf_idx;

static nrf_atomic_flag_t m_timeslot_session_open;
static nrf_atomic_flag_t m_pending_close;
static nrf_atomic_u32_t  m_blocked_cancelled_count;
static uint32_t          m_total_timeslot_length = 0;
static uint32_t          m_timeslot_distance = 0;
static uint32_t          m_tx_slot_retry_count = 0;
static uint32_t          m_usec_since_sync_packet = 0;
static uint32_t          m_usec_since_tx_offset_calc = 0;
static ts_params_t       m_params;

static nrf_atomic_flag_t m_send_sync_pkt = false;
static nrf_atomic_flag_t m_timer_update_in_progress = false;

static bool m_synchronized = false;

static volatile int64_t  m_master_counter_diff = 0;
static nrf_atomic_u32_t  m_rcv_count      = 0;

static nrf_atomic_u32_t  mp_curr_adj_pkt;
static nrf_atomic_u32_t  m_curr_adj_timer;
static nrf_atomic_u32_t  m_curr_adj_counter;

static ts_evt_handler_t m_callback;
static nrf_atomic_u32_t m_tick_target;
static nrf_atomic_u32_t m_sync_packet_count = 0;
static nrf_atomic_u32_t m_used_packet_count = 0;
static nrf_atomic_u32_t m_last_sync = 0;

static nrf_ppi_channel_t m_timestamp_trigger_ppi[2];
static bool m_timestamp_trigger_set = false;

static volatile enum
{
    RADIO_STATE_IDLE, /* Default state */
    RADIO_STATE_RX,   /* Waiting for packets */
    RADIO_STATE_TX    /* Trying to transmit packet */
} m_radio_state = RADIO_STATE_IDLE;

static void ppi_counter_timer_triggered_capture_configure(nrf_ppi_channel_t chn[2], uint32_t eep);
static bool sync_timer_offset_compensate(sync_pkt_t * p_pkt);
static void timeslot_begin_handler(void);
static void timeslot_end_handler(void);

/**< This will be used when requesting the first timeslot or any time a timeslot is blocked or cancelled. */
static nrf_radio_request_t m_timeslot_req_earliest = {
        NRF_RADIO_REQ_TYPE_EARLIEST,
        .params.earliest = {
            NRF_RADIO_HFCLK_CFG_XTAL_GUARANTEED,
            NRF_RADIO_PRIORITY_NORMAL,
            TS_LEN_US,
            100000 /* Expect timeslot within 100 ms */
        }};

/**< This will be used at the end of each timeslot to request the next timeslot. */
static nrf_radio_request_t m_timeslot_req_normal = {
        NRF_RADIO_REQ_TYPE_NORMAL,
        .params.normal = {
            NRF_RADIO_HFCLK_CFG_XTAL_GUARANTEED,
            NRF_RADIO_PRIORITY_NORMAL,
            0,
            TS_LEN_US
        }};

/**< This will be used at the end of each timeslot to request the next timeslot. */
static nrf_radio_signal_callback_return_param_t m_rsc_return_sched_next_normal = {
        NRF_RADIO_SIGNAL_CALLBACK_ACTION_REQUEST_AND_END,
        .params.request = {
                (nrf_radio_request_t*) &m_timeslot_req_normal
        }};

/**< This will be used at the end of each timeslot to request the next timeslot. */
static nrf_radio_signal_callback_return_param_t m_rsc_return_sched_next_earliest = {
        NRF_RADIO_SIGNAL_CALLBACK_ACTION_REQUEST_AND_END,
        .params.request = {
                (nrf_radio_request_t*) &m_timeslot_req_earliest
        }};

/**< This will be used at the end of each timeslot to request an extension of the timeslot. */
static nrf_radio_signal_callback_return_param_t m_rsc_extend = {
        NRF_RADIO_SIGNAL_CALLBACK_ACTION_EXTEND,
        .params.extend = {TX_LEN_EXTENSION_US}
        };

/**< This will be used at the end of each timeslot to request the next timeslot. */
static nrf_radio_signal_callback_return_param_t m_rsc_return_no_action = {
        NRF_RADIO_SIGNAL_CALLBACK_ACTION_NONE,
        .params.request = {NULL}
        };

static void increment_desync_timeout(uint32_t increment_usec)
{
    if (m_send_sync_pkt)
    {
        // No desync as transmitter
        return;
    }

    m_usec_since_sync_packet += increment_usec;
    if (m_usec_since_sync_packet >= TIME_SYNC_DESYNC_TIMEOUT)
    {
        m_params.egu->TASKS_TRIGGER[3] = 1;
        m_usec_since_sync_packet = 0; // Reset to suppress needless irq generation
    }
}

static sync_pkt_t * tx_buf_get(void)
{
    uint32_t idx;

