jonacappelle/nRF52-DCU/TimeSync/time_sync.c
    // Packet format
    NRF_RADIO->PCNF0 = (0 << RADIO_PCNF0_S0LEN_Pos) | (0 << RADIO_PCNF0_LFLEN_Pos) | (0 << RADIO_PCNF0_S1LEN_Pos);
    NRF_RADIO->PCNF1 = (RADIO_PCNF1_WHITEEN_Disabled     << RADIO_PCNF1_WHITEEN_Pos) |
                       (RADIO_PCNF1_ENDIAN_Big           << RADIO_PCNF1_ENDIAN_Pos)  |
                       (4                                << RADIO_PCNF1_BALEN_Pos)   |
                       (sizeof(sync_pkt_t)               << RADIO_PCNF1_STATLEN_Pos) |
                       (sizeof(sync_pkt_t)               << RADIO_PCNF1_MAXLEN_Pos);
    NRF_RADIO->PACKETPTR = (uint32_t) p_pkt;

    // Radio address config
    NRF_RADIO->PREFIX0 = m_params.rf_addr[0];
    NRF_RADIO->BASE0   = (m_params.rf_addr[1] << 24 | m_params.rf_addr[2] << 16 | m_params.rf_addr[3] << 8 | m_params.rf_addr[4]);

    NRF_RADIO->TXADDRESS   = 0; // use logical address 0 for transmit
    NRF_RADIO->RXADDRESSES = (1 << 0); // enable logical address 0 for receive

    NRF_RADIO->FREQUENCY = m_params.rf_chn;
    NRF_RADIO->TXPOWER   = RADIO_TXPOWER_TXPOWER_Pos4dBm << RADIO_TXPOWER_TXPOWER_Pos;

    NRF_RADIO->EVENTS_END = 0;

    NRF_RADIO->INTENCLR = 0xFFFFFFFF;
    NRF_RADIO->INTENSET = RADIO_INTENSET_END_Msk;

    NVIC_EnableIRQ(RADIO_IRQn);
}

void timeslot_end_handler(void)
{
    NRF_RADIO->TASKS_DISABLE = 1;
    NRF_RADIO->INTENCLR      = 0xFFFFFFFF;

    ppi_radio_rx_disable();

    m_radio_state           = RADIO_STATE_IDLE;
}

void timeslot_begin_handler(void)
{
    sync_pkt_t * p_pkt;

    m_total_timeslot_length = 0;

    if (!m_send_sync_pkt)
    {
        if (m_radio_state    != RADIO_STATE_RX ||
            NRF_RADIO->STATE != (RADIO_STATE_STATE_Rx << RADIO_STATE_STATE_Pos))
        {
            p_pkt = tx_buf_get();

            update_radio_parameters(p_pkt);

            NRF_RADIO->SHORTS     = RADIO_SHORTS_READY_START_Msk;
            NRF_RADIO->TASKS_RXEN = 1;

            ppi_radio_rx_configure();

            m_radio_state = RADIO_STATE_RX;
        }

        return;
    }

    if (m_radio_state == RADIO_STATE_RX)
    {
        // Packet transmission has now started (state change from RX).
        NRF_RADIO->EVENTS_DISABLED = 0;
        NRF_RADIO->TASKS_DISABLE = 1;
        while (NRF_RADIO->EVENTS_DISABLED == 0)
        {
            __NOP();
        }
    }

    p_pkt = tx_buf_get();

    ppi_radio_tx_configure();
    update_radio_parameters(p_pkt);

    NRF_RADIO->SHORTS     = RADIO_SHORTS_END_DISABLE_Msk | RADIO_SHORTS_READY_START_Msk;
    NRF_RADIO->TASKS_TXEN = 1;

    while (NRF_RADIO->EVENTS_READY == 0)
    {
        // PPI is used to trigger sync timer capture when radio is ready
        // Radio will automatically start transmitting once ready, so the captured timer value must be copied into radio packet buffer ASAP
        __NOP();
    }

    p_pkt->timer_val   = m_params.high_freq_timer[0]->CC[1];
    p_pkt->counter_val = m_params.high_freq_timer[1]->CC[1];

//    p_pkt->rtc_val     = m_params.rtc->COUNTER;

    // m_trigger_evt.params.triggered.sync_packet_count++; // tx packet sent
    nrf_atomic_u32_add(&m_sync_packet_count, 1);
    m_radio_state = RADIO_STATE_TX;
}

/**@brief Function for handling the Application's system events.
 *
 * @param[in]   sys_evt   system event.
 */
void ts_on_sys_evt(uint32_t sys_evt, void * p_context)
{
    switch(sys_evt)
    {
        case NRF_EVT_FLASH_OPERATION_SUCCESS:
        case NRF_EVT_FLASH_OPERATION_ERROR:
            break;
        case NRF_EVT_RADIO_BLOCKED:
        case NRF_EVT_RADIO_CANCELED:
        {
            // NRF_LOG_INFO("---");
            // NRF_LOG_INFO("m_pending_close: %d", m_pending_close);
            // NRF_LOG_INFO("sys_evt: %d", sys_evt);
            // NRF_LOG_INFO("m_tx_slot_retry_count: %d", m_tx_slot_retry_count);
            // NRF_LOG_INFO("m_send_sync_pkt: %d", m_send_sync_pkt);
            // NRF_LOG_INFO("m_timeslot_session_open: %d", m_timeslot_session_open);
            // NRF_LOG_INFO("---");

            if (!m_pending_close)
            {
                /*
                 * This is caused by a conflict with an active BLE session.
                 * This will mess up the tx frequency, because the next request is scheduled immediately
                 */
                // Blocked events are rescheduled with normal priority. They could also
                // be rescheduled with high priority if necessary.
                if (m_send_sync_pkt && m_tx_slot_retry_count < 5)
                {
                    ++m_tx_slot_retry_count;
                    m_timeslot_req_normal.params.normal.distance_us = m_timeslot_distance * (m_tx_slot_retry_count + 2);
                    uint32_t err_code = sd_radio_request((nrf_radio_request_t*) &m_timeslot_req_normal);
                    // NRF_LOG_INFO("sd_radio_request normal: %d", err_code);

                    //  @retval ::NRF_ERROR_FORBIDDEN Either:
                    //  - The session is not open. -> session is open
                    //  - The session is not IDLE. -> session is not idle
                    //  - This is the first request and its type is not @ref NRF_RADIO_REQ_TYPE_EARLIEST. -> possible cause
                    //  - The request type was set to @ref NRF_RADIO_REQ_TYPE_NORMAL after a @ref NRF_RADIO_REQ_TYPE_EARLIEST request was blocked.
                    if(err_code == NRF_ERROR_FORBIDDEN)
                    {                    
                        // If request for normal timeslot fails, then request timeslot earliest
                        uint32_t err_code = sd_radio_request((nrf_radio_request_t*) &m_timeslot_req_earliest);
                        // NRF_LOG_INFO("sd_radio_request earliest: %d", err_code);
                        APP_ERROR_CHECK(err_code);

                        NRF_LOG_INFO("!!FORBIDDEN!! timeslot with type normal");
                        NRF_LOG_FLUSH();
                    }
                    APP_ERROR_CHECK(err_code);
                }
                else
                {
                    uint32_t err_code = sd_radio_request((nrf_radio_request_t*) &m_timeslot_req_earliest);
                    // NRF_LOG_INFO("sd_radio_request earliest: %d", err_code);
                    APP_ERROR_CHECK(err_code);
                }

                nrf_atomic_u32_add(&m_blocked_cancelled_count, 1);
            }
            break;
        }
        case NRF_EVT_RADIO_SIGNAL_CALLBACK_INVALID_RETURN:
            NRF_LOG_ERROR("NRF_EVT_RADIO_SIGNAL_CALLBACK_INVALID_RETURN\r\n");
            app_error_handler(MAIN_DEBUG, __LINE__, (const uint8_t*)__FILE__);
            break;
        case NRF_EVT_RADIO_SESSION_CLOSED:
            nrf_atomic_flag_clear(&m_timeslot_session_open);
            nrf_atomic_flag_clear(&m_pending_close);
            NRF_LOG_INFO("NRF_EVT_RADIO_SESSION_CLOSED\r\n");
            break;
        case NRF_EVT_RADIO_SESSION_IDLE:
        {
            NRF_LOG_INFO("NRF_EVT_RADIO_SESSION_IDLE\r\n");

            uint32_t err_code = sd_radio_session_close();
            APP_ERROR_CHECK(err_code);
            break;
        }
        default:
            // No implementation needed.
            NRF_LOG_INFO("Event: 0x%08x\r\n", sys_evt);
            break;
    }
}

static void timestamp_counter_start(void)
{
    // m_params.high_freq_timer[1] (NRF_TIMER) is used in counter mode to count the number of sync timer overflows/resets (m_params.high_freq_timer[0])
    // When timestamp API is used, the number of overflows/resets + current value of sync timer must be added up to give accurate timestamp information
    m_params.high_freq_timer[1]->TASKS_STOP  = 1;
    m_params.high_freq_timer[1]->TASKS_CLEAR = 1;
    m_params.high_freq_timer[1]->PRESCALER   = 0;
    m_params.high_freq_timer[1]->MODE        = TIMER_MODE_MODE_Counter << TIMER_MODE_MODE_Pos;;
    m_params.high_freq_timer[1]->BITMODE     = TIMER_BITMODE_BITMODE_32Bit << TIMER_BITMODE_BITMODE_Pos;
    m_params.high_freq_timer[1]->TASKS_START = 1;
}

static void sync_timer_start(void)
{
    // m_params.high_freq_timer[0] (NRF_TIMER) is the always-running sync timer
    // The timing master never adjusts this timer
    // The timing slave(s) adjusts this timer whenever a sync packet is received and the logic determines that there is
    m_params.high_freq_timer[0]->TASKS_STOP  = 1;
    m_params.high_freq_timer[0]->TASKS_CLEAR = 1;
    m_params.high_freq_timer[0]->PRESCALER   = SYNC_TIMER_PRESCALER;
    m_params.high_freq_timer[0]->BITMODE     = TIMER_BITMODE_BITMODE_32Bit << TIMER_BITMODE_BITMODE_Pos;
    m_params.high_freq_timer[0]->CC[0]       = TIME_SYNC_TIMER_MAX_VAL;
    m_params.high_freq_timer[0]->CC[1]       = 0xFFFFFFFF;
    m_params.high_freq_timer[0]->CC[2]       = 0xFFFFFFFF;
    m_params.high_freq_timer[0]->CC[3]       = 0xFFFFFFFF;

