jonacappelle/nRF52-DCU/TimeSync/time_sync.c
    // if (m_params.high_freq_timer[0] == NRF_TIMER3 || m_params.high_freq_timer[0] == NRF_TIMER4)
    // {
    //     // TIMERS 0,1, and 2 only have 4 compare registers
    //     m_params.high_freq_timer[0]->CC[5]   = TIME_SYNC_TIMER_MAX_VAL / 2; // Only used for debugging purposes such as pin toggling
    // }

    m_params.high_freq_timer[0]->SHORTS      = TIMER_SHORTS_COMPARE0_CLEAR_Msk;
    m_params.high_freq_timer[0]->TASKS_START = 1;
}

uint32_t ts_set_trigger(uint32_t target_tick, uint32_t ppi_endpoint)
{
    // if (!m_timeslot_session_open)
    // {
    //     return NRF_ERROR_INVALID_STATE;
    // }

    if (ppi_sync_trigger_configure(ppi_endpoint) != NRF_SUCCESS)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    nrf_atomic_u32_store(&m_sync_packet_count, 0);
    nrf_atomic_u32_store(&m_used_packet_count, 0);

    // TODO: is there a way to check if the target value is plausible?
    // m_trigger_evt.params.triggered.tick_start = ts_timestamp_get_ticks_u64() / TIME_SYNC_TIMER_MAX_VAL;

    m_params.high_freq_timer[1]->CC[4] = target_tick - m_master_counter_diff;
    nrf_atomic_u32_store(&m_tick_target, target_tick);
    nrf_ppi_channel_enable(m_params.ppi_chns[4]); // activate trigger
    return NRF_SUCCESS;
}

uint32_t ts_set_timestamp_trigger(uint32_t ppi_event_endpoint)
{
    // TODO: Check if other timers can be used also
    if (m_params.high_freq_timer[0] != NRF_TIMER3 && m_params.high_freq_timer[0] != NRF_TIMER4)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (m_params.high_freq_timer[1] != NRF_TIMER3 && m_params.high_freq_timer[1] != NRF_TIMER4)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (!m_timestamp_trigger_set)
    {
        nrfx_err_t err;

        for (int i = 0; i < ARRAY_SIZE(m_timestamp_trigger_ppi); ++i)
        {
            err = nrfx_ppi_channel_alloc(&m_timestamp_trigger_ppi[i]);
            if (err != NRFX_SUCCESS)
            {
                return err;
            }
        }
    }

    ppi_counter_timer_triggered_capture_configure(m_timestamp_trigger_ppi, ppi_event_endpoint);

    m_timestamp_trigger_set = true;

    return NRF_SUCCESS;
}

void SWI3_EGU3_IRQHandler(void)
{
    if (NRF_EGU3->EVENTS_TRIGGERED[0] != 0)
    {
        m_master_counter_diff = ((sync_pkt_t *) mp_curr_adj_pkt)->counter_val - m_curr_adj_counter;
        nrf_atomic_u32_add(&m_used_packet_count, 1);
        nrf_atomic_u32_store(&m_last_sync, (m_curr_adj_counter - m_master_counter_diff));

        m_params.high_freq_timer[0]->CC[2] = 0;

        nrf_atomic_flag_clear(&m_timer_update_in_progress);

        NRF_EGU3->EVENTS_TRIGGERED[0] = 0;

        if (!m_synchronized)
        {
            m_synchronized = true;

            if (m_callback)
            {
                ts_evt_t evt =
                {
                    .type = TS_EVT_SYNCHRONIZED,
                };

                m_callback(&evt);
            }
        }
    }

    if (NRF_EGU3->EVENTS_TRIGGERED[2] != 0)
    {
        NRF_EGU3->EVENTS_TRIGGERED[2] = 0;
        nrf_ppi_channel_disable(m_params.ppi_chns[4]);

        if (m_callback)
        {
            ts_evt_t trigger_evt =
            {
                .type = TS_EVT_TRIGGERED,
                .params.triggered.tick_target = m_tick_target,
                .params.triggered.last_sync = m_last_sync,
                .params.triggered.sync_packet_count = m_sync_packet_count,
                .params.triggered.used_packet_count = m_used_packet_count,
            };
            m_callback(&trigger_evt);
        }
    }

    if (NRF_EGU3->EVENTS_TRIGGERED[3] != 0)
    {
        NRF_EGU3->EVENTS_TRIGGERED[3] = 0;

        if (m_synchronized)
        {
            m_synchronized = false;

            if (m_callback)
            {
                ts_evt_t evt =
                {
                    .type = TS_EVT_DESYNCHRONIZED,
                };

                m_callback(&evt);
            }
        }
    }

    if (NRF_EGU3->EVENTS_TRIGGERED[4] != 0)
    {
        // TODO: Remove this event, as it is not currently used
        NRF_EGU3->EVENTS_TRIGGERED[4] = 0;
    }

    if (NRF_EGU3->EVENTS_TRIGGERED[5] != 0)
    {
        uint64_t timestamp;
        uint32_t counter_val;

        NRF_EGU3->EVENTS_TRIGGERED[5] = 0;

        counter_val = m_params.high_freq_timer[1]->CC[5];

        if ((m_params.high_freq_timer[0]->CC[5] <= 5) || (m_params.high_freq_timer[0]->CC[5] == TIME_SYNC_TIMER_MAX_VAL) || (m_params.high_freq_timer[0]->CC[2] != 0 && m_params.high_freq_timer[0]->CC[5] == m_params.high_freq_timer[0]->CC[2]))
        {
            // Check if counter increment was caught
            m_params.high_freq_timer[1]->TASKS_CAPTURE[5] = 1;
            if (m_params.high_freq_timer[1]->CC[5] != counter_val)
            {
                counter_val = m_params.high_freq_timer[1]->CC[5];
            }
        }

        timestamp  = counter_val;
        timestamp += m_master_counter_diff;
        timestamp *= TIME_SYNC_TIMER_MAX_VAL;
        timestamp += m_params.high_freq_timer[0]->CC[5];

        if (m_callback)
        {
            ts_evt_t evt =
            {
                .type = TS_EVT_TIMESTAMP,
                .params.timestamp = timestamp,
            };

            m_callback(&evt);
        }
    }
}

static inline bool sync_timer_offset_compensate(sync_pkt_t * p_pkt)
{
    uint32_t peer_timer;
    uint32_t local_timer;
    int32_t timer_offset;
    bool wrapped = false;

    if (m_timer_update_in_progress)
    {
        return false;
    }

    peer_timer  = p_pkt->timer_val;
    peer_timer += TX_CHAIN_DELAY;
    if (peer_timer > TIME_SYNC_TIMER_MAX_VAL)
    {
        peer_timer -= TIME_SYNC_TIMER_MAX_VAL;
        p_pkt->counter_val += 1;
        wrapped = true;
    }

    local_timer = m_params.high_freq_timer[0]->CC[1];
    timer_offset = local_timer - peer_timer;

    // NRF_LOG_INFO("timer_offset: %d (wrapped: %d)", timer_offset, wrapped);
    // NRF_LOG_INFO("Local: %lu, Remote: %lu", local_timer, peer_timer);

    if (timer_offset == 0 || timer_offset == TIME_SYNC_TIMER_MAX_VAL)
    {
        // Already in sync
        nrf_atomic_u32_add(&m_used_packet_count, 1);
        // nrf_atomic_u32_store(&m_last_sync, p_pkt->counter_val);
        return false;
    }

    if (wrapped && (local_timer >= (TIME_SYNC_TIMER_MAX_VAL - 50)))
    {
        // Too close
        // Todo: see if local counter increment can be accounted for
        // NRF_LOG_INFO("SKIPPED");
        return false;
    }

    if (timer_offset < 0)
    {
        // Local timer is ahead of peer: cut current cycle short
        m_params.high_freq_timer[0]->CC[2] = TIME_SYNC_TIMER_MAX_VAL + timer_offset;
        ppi_sync_timer_adjust_configure(true);
    }
    else
    {
        // Local timer is behind peer: cut next cycle short
        m_params.high_freq_timer[0]->CC[2] = timer_offset;
        ppi_sync_timer_adjust_configure(false);
    }

    APP_ERROR_CHECK_BOOL(m_params.high_freq_timer[0]->CC[2] < TIME_SYNC_TIMER_MAX_VAL);

    nrf_atomic_flag_set(&m_timer_update_in_progress);
    nrf_atomic_u32_fetch_store(&mp_curr_adj_pkt, (uint32_t) p_pkt);

    nrf_atomic_u32_store(&m_curr_adj_timer, m_params.high_freq_timer[0]->CC[1]);
    nrf_atomic_u32_store(&m_curr_adj_counter, m_params.high_freq_timer[1]->CC[1]);

