jonacappelle/nRF52-DCU/TimeSync/time_sync.c
    err_code = sd_radio_request(&m_timeslot_req_earliest);
    NRF_LOG_INFO("initial sd_radio_request earliest: %d", err_code);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    ppi_timestamp_timer_configure();
    // ppi_sync_timer_adjust_configure();

    NVIC_ClearPendingIRQ(m_params.egu_irq_type);
    NVIC_SetPriority(m_params.egu_irq_type, TIME_SYNC_EVT_HANDLER_IRQ_PRIORITY);
    NVIC_EnableIRQ(m_params.egu_irq_type);

    m_params.egu->INTENCLR = 0xFFFFFFFF;
    m_params.egu->INTENSET = EGU_INTENSET_TRIGGERED0_Msk | EGU_INTENSET_TRIGGERED2_Msk | EGU_INTENSET_TRIGGERED3_Msk | EGU_INTENSET_TRIGGERED4_Msk | EGU_INTENSET_TRIGGERED5_Msk;

    m_blocked_cancelled_count  = 0;
    m_radio_state              = RADIO_STATE_IDLE;

    nrf_atomic_flag_clear(&m_send_sync_pkt);

    timestamp_counter_start();
    sync_timer_start();

    nrf_atomic_flag_set(&m_timeslot_session_open);

    return NRF_SUCCESS;
}

uint32_t ts_disable(void)
{
    uint32_t err_code;

    nrf_atomic_flag_set(&m_pending_close);

    err_code = sd_radio_session_close();
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // TODO: stop timer

    err_code = sd_clock_hfclk_release();
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    err_code |= sd_power_mode_set(NRF_POWER_MODE_LOWPWR);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // TODO:
    //       - Close SoftDevice radio session (sd_radio_session_close())
    //       - Stop radio activity
    //       - Stop timers
    //       - Disable used PPI channels
    //       - Disable used interrupts
    //       - Release HFCLK (sd_clock_hfclk_release()),
    //       - Go back to low-power (mode sd_power_mode_set(NRF_POWER_MODE_LOWPWR))
    // Care must be taken to ensure clean stop. Order of tasks above should be reconsidered.
    return NRF_SUCCESS;
}

uint32_t ts_tx_start(uint32_t sync_freq_hz)
{
    uint32_t distance;

    if (sync_freq_hz == TIME_SYNC_FREQ_AUTO)
    {
        // 20-30 Hz is a good range
        // Higher frequency gives more margin for missed packets, but doesn't improve accuracy
        uint32_t auto_freq_target = 30;
        distance = (ROUNDED_DIV(ROUNDED_DIV(1000000, auto_freq_target), (TIME_SYNC_TIMER_MAX_VAL / 16))) * (TIME_SYNC_TIMER_MAX_VAL / 16);
    }
    else
    {
        distance = (1000000 / sync_freq_hz);
    }

    if (distance >= NRF_RADIO_DISTANCE_MAX_US)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    m_timeslot_distance = distance;
    m_usec_since_tx_offset_calc = 0;

    nrf_atomic_flag_set(&m_send_sync_pkt);

    NRF_LOG_INFO("Sending first sync packet...");

    return NRF_SUCCESS;
}

uint32_t ts_tx_stop()
{
    nrf_atomic_flag_clear(&m_send_sync_pkt);

    return NRF_SUCCESS;
}

uint32_t ts_timestamp_get_ticks_u32(void)
{
    uint32_t sync_timer_val;
    uint32_t count_timer_val;
    int32_t peer_diff;

    timers_capture(&sync_timer_val, &count_timer_val, &peer_diff);

    return (((count_timer_val + peer_diff) * TIME_SYNC_TIMER_MAX_VAL) + sync_timer_val);
}

uint64_t ts_timestamp_get_ticks_u64(void)
{
    uint32_t sync_timer_val;
    uint32_t count_timer_val;
    uint64_t timestamp;
    int32_t  peer_diff;

    timers_capture(&sync_timer_val, &count_timer_val, &peer_diff);

    timestamp  = (uint64_t) count_timer_val;
    timestamp += (uint64_t) peer_diff;
    timestamp *= TIME_SYNC_TIMER_MAX_VAL;
    timestamp += (uint64_t) sync_timer_val;

    return timestamp;
}
